Repository: LVIPHU/officialwalletweb
Catalog: src/i18n/locales/*/messages.po
Languages: ar, es, fi, fr, pt

source: . All rights reserved.
ar: جميع الحقوق محفوظة.
es: . Todos los derechos reservados.
fi: . Kaikki oikeudet pidätetään.
fr: . Tous droits réservés.
pt: . Todos os direitos reservados.

source: 1. Download TBC Wallet from the App Store, Google Play, or our website. 2. Create a new wallet or import an existing one. 3. Secure your wallet with a strong password and backup your recovery phrase. 4. Start managing your digital assets.
ar: 1. قم بتنزيل محفظة TBC من App Store أو Google Play أو موقعنا الإلكتروني. 2. أنشئ محفظة جديدة أو استورد محفظة موجودة. 3. قم بتأمين محفظتك بكلمة مرور قوية وقم بنسخ عبارة الاسترداد احتياطيًا. 4. ابدأ في إدارة أصولك الرقمية.
fi: 1. Lataa TBC Wallet App Storesta, Google Playsta tai verkkosivuiltamme. 2. Luo uusi lompakko tai tuo olemassa oleva. 3. Suojaa lompakkosi vahvalla salasanalla ja varmuuskopioi palautuslauseesi. 4. Aloita digitaalisten varojesi hallinta.
pt: 1. Baixe o TBC Wallet na App Store, Google Play ou em nosso site. 2. Crie uma nova carteira ou importe uma existente. 3. Proteja sua carteira com uma senha forte e faça backup da sua frase de recuperação. 4. Comece a gerenciar seus ativos digitais.

source: 1. Go to Settings. 2. Select Security. 3. Choose Change Password. 4. Enter your current and new password. 5. Confirm the change.
ar: 1. انتقل إلى الإعدادات. 2. اختر الأمان. 3. اختر تغيير كلمة المرور. 4. أدخل كلمة المرور الحالية والجديدة. 5. أكد التغيير.
es: 1. Ve a Configuración. 2. Selecciona Seguridad. 3. Elige Cambiar Contraseña. 4. Ingresa tu contraseña actual y nueva. 5. Confirma el cambio.
fi: 1. Siirry Asetuksiin. 2. Valitse Turvallisuus. 3. Valitse Vaihda salasana. 4. Syötä nykyinen ja uusi salasanasi. 5. Vahvista muutos.
fr: 1. Allez dans Paramètres. 2. Sélectionnez Sécurité. 3. Choisissez Changer le mot de passe. 4. Entrez votre mot de passe actuel et nouveau. 5. Confirmez le changement.
pt: 1. Vá para Configurações. 2. Selecione Segurança. 3. Escolha Alterar Senha. 4. Digite sua senha atual e nova. 5. Confirme a alteração.

source: About
ar: حول
es: Acerca de
fi: Tietoja
fr: À propos
pt: Sobre

source: Account Management
ar: إدارة الحساب
es: Gestión de Cuenta
fi: Tilin hallinta
fr: Gestion de Compte
pt: Gerenciamento de Conta

source: Additional Resources
ar: موارد إضافية
es: Recursos Adicionales
fi: Lisäresurssit
fr: Ressources Supplémentaires
pt: Recursos Adicionais

source: Always backup your recovery phrase (12 or 24 words) in a secure location: Write it down on paper and store it safely. Never store it digitally or share it online. Consider using a hardware wallet for additional security.
ar: احتفظ دائمًا بنسخة احتياطية من عبارة الاسترداد (12 أو 24 كلمة) في مكان آمن: اكتبها على الورق واحفظها بأمان. لا تخزنها رقميًا أو تشاركها عبر الإنترنت أبدًا. فكر في استخدام محفظة أجهزة لأمان إضافي.
es: Siempre haz una copia de seguridad de tu frase de recuperación (12 o 24 palabras) en un lugar seguro: Escríbela en papel y guárdala de forma segura. Nunca la almacenes digitalmente ni la compartas en línea. Considera usar una billetera de hardware para mayor seguridad.
fi: Varmuuskopioi aina palautuslauseesi (12 tai 24 sanaa) turvallisessa paikassa: Kirjoita se paperille ja säilytä turvallisesti. Älä koskaan tallenna sitä digitaalisesti tai jaa verkossa. Harkitse laitelompakon käyttöä lisäturvallisuudeksi.
fr: Toujours sauvegarder votre phrase de récupération (12 ou 24 mots) dans un endroit sûr : Écrivez-la sur papier et conservez-la en sécurité. Ne la stockez jamais numériquement ni ne la partagez en ligne. Envisagez d'utiliser un portefeuille matériel pour une sécurité supplémentaire.
pt: Sempre faça backup da sua frase de recuperação (12 ou 24 palavras) em um local seguro: Anote-a em papel e guarde-a com segurança. Nunca a armazene digitalmente nem a compartilhe online. Considere usar uma carteira de hardware para segurança adicional.

source: An optimized Web3 experience for desktop
ar: تجربة Web3 محسّنة لأجهزة سطح المكتب
es: Una experiencia Web3 optimizada para computadoras de escritorio
fi: Optimoitu Web3-kokemus työpöydälle
fr: Une expérience Web3 optimisée pour ordinateur de bureau
pt: Uma experiência Web3 otimizada para desktop

source: Android APK
ar: APK أندرويد
pt: APK Android

source: Android app
ar: تطبيق أندرويد
es: Aplicación para Android
fi: Android-sovellus
fr: Application Android
pt: Aplicativo Android

source: Are there tutorials available?
ar: هل توجد دروس تعليمية متاحة؟
es: ¿Hay tutoriales disponibles?
fi: Onko opetusohjelmia saatavilla?
fr: Y a-t-il des tutoriels disponibles ?
pt: Existem tutoriais disponíveis?

source: Bitcoin
ar: بيتكوين

source: Boost earnings by connecting to mining pools and tracking rewards in-app
ar: عزّز أرباحك بالربط بمجمعات التعدين وتتبع المكافآت داخل التطبيق
es: Incrementa tus ganancias conectándote a pools de minería y siguiendo recompensas en la app
fi: Lisää tuottojasi yhdistämällä kaivosaltaisiin ja seuraamalla palkkioita sovelluksessa
fr: Augmentez vos gains en vous connectant à des pools de minage et en suivant les récompenses dans l'application
pt: Aumente os ganhos ao conectar-se a pools de mineração e acompanhar recompensas no aplicativo

source: Boost earnings by connecting to mining pools and tracking rewards in-app. TBC Wallet simplifies mining management, helping both new and seasoned users maximize returns securely.
ar: عزّز أرباحك بالربط بمجمعات التعدين وتتبع المكافآت داخل التطبيق. محفظة TB تُبسّط إدارة التعدين، الأمر الذي يساعد المستخدمين الجدد وذوي الخبرة على تعظيم العوائد بأمان.
fi: Lisää tuottojasi yhdistämällä kaivosaltaisiin ja seuraamalla palkkioita sovelluksessa. TBC Wallet yksinkertaistaa kaivoshallintaa ja auttaa sekä uusia että kokeneita käyttäjiä maksimoimaan tuotot turvallisesti.
pt: Aumente os ganhos ao conectar-se a pools de mineração e acompanhar recompensas no aplicativo. A TBC Wallet simplifica a gestão de mineração, ajudando tanto novos quanto usuários experientes a maximizar retornos com segurança.

source: Browser Extension
ar: امتداد المتصفح
es: Extensión del navegador
fi: Selainlaajennus
fr: Extension de navigateur
pt: Extensão do navegador

source: Can I cancel a transaction?
ar: هل يمكنني إلغاء معاملة؟
es: ¿Puedo cancelar una transacción?
fi: Voinko peruuttaa tapahtuman?
fr: Puis-je annuler une transaction ?
pt: Posso cancelar uma transação?

source: Can I have multiple wallets?
ar: هل يمكنني الحصول على محافظ متعددة؟
es: ¿Puedo tener múltiples billeteras?
fi: Voinko omistaa useita lompakoita?
fr: Puis-je avoir plusieurs portefeuilles ?
pt: Posso ter várias carteiras?

source: Can I pay fees with USDT?
ar: هل يمكنني دفع الرسوم بـ USDT؟
es: ¿Puedo pagar las tarifas con USDT?
fi: Voinko maksaa maksut USDT:llä?
fr: Puis-je payer les frais avec USDT ?
pt: Posso pagar taxas com USDT?

source: Can TBC Wallet access my funds?
ar: هل يمكن لمحفظة TBC الوصول إلى أموالي؟
fi: Voiko TBC Wallet käyttää varojani?
pt: O TBC Wallet pode acessar meus fundos?

source: Coming soon
ar: قريبًا
es: Próximamente
fi: Tulossa pian
fr: Bientôt disponible
pt: Em breve

source: Community talk about us
ar: المجتمع يتحدث عنا
es: La comunidad habla de nosotros
fi: Yhteisö puhuu meistä
fr: La communauté parle de nous
pt: A comunidade fala sobre nós

source: Contact Us
ar: اتصل بنا
es: Contáctanos
fi: Ota yhteyttä
fr: Contactez-nous
pt: Fale conosco

source: Designed for All, Built for You
ar: مصمم للجميع، ومبني خصيصًا لك
es: Diseñado para todos, creado para ti
fi: Suunniteltu kaikille, rakennettu sinulle
fr: Conçu pour tous, développé pour vous
pt: Projetado para todos, feito para você

source: Desktop app
ar: تطبيق سطح المكتب
es: Aplicación de escritorio
fi: Työpöytäsovellus
fr: Application de bureau
pt: Aplicativo para desktop

source: Download
ar: تحميل
es: Descargar
fi: Lataa
fr: Télécharger
pt: Baixar

source: Download now
ar: حمّل الآن
es: Descargar ahora
fi: Lataa nyt
fr: Télécharger maintenant
pt: Baixe agora

source: Download on the
ar: تحميل على
es: Descargar en
fi: Lataa
fr: Télécharger sur
pt: Baixar no

source: Effortlessly exchange tokens across chains with low fees and real-time rates. Whether trading Bitcoin for Solana or optimizing your portfolio, TBC Wallet makes swaps quick and intuitive.
ar: قم بتبادل التوكنات بسهولة عبر السلاسل برسوم منخفضة وأسعار فورية. سواء كنت تتداول بيتكوين مقابل سولانا أو تحسّن محفظتك، محفظة TB تجعل المبادلات سريعة وبديهية.

source: Ethereum
ar: إيثيريوم

source: Explore now
ar: استكشف الآن
es: Explorar ahora
fi: Tutustu nyt
fr: Explorer maintenant
pt: Explorar agora

source: Extension
ar: امتداد
es: Extensión
fi: Laajennus
pt: Extensão

source: FAQ
ar: الأسئلة الشائعة
es: Preguntas frecuentes
fi: UKK
pt: Perguntas frequentes

source: Features
ar: الميزات
es: Funciones
fi: Ominaisuudet
fr: Fonctionnalités
pt: Recursos

source: Find answers to frequently asked questions about TBC Wallet
ar: ابحث عن إجابات للأسئلة الشائعة حول TBC Wallet
fi: Löydä vastauksia usein kysyttyihin kysymyksiin TBC Walletista
pt: Encontre respostas para perguntas frequentes sobre TBC Wallet

source: Fortify your wallet with multi-approval transactions for enhanced protection
ar: عزّز محفظتك بمعاملات متعددة الموافقات لحماية أكبر
es: Fortalece tu billetera con transacciones de aprobación múltiple para mayor protección
fi: Vahvista lompakkosi monivaiheisilla hyväksymisillä parannettua suojausta varten
fr: Renforcez votre portefeuille avec des transactions à approbations multiples pour une protection accrue
pt: Reforce sua carteira com transações de múltiplas aprovações para maior proteção

source: Fortify your wallet with multi-approval transactions for enhanced protection against threats—ideal for personal or shared use, ensuring your assets stay safe and accessible only to you.
ar: عزّز محفظتك بمعاملات متعددة الموافقات لحماية أكبر من التهديدات — مثالية للاستخدام الشخصي أو المشترك، لضمان بقاء أصولك آمنة ومُتاحة فقط لك.
es: Fortalece tu billetera con transacciones de aprobación múltiple para una protección mejorada contra amenazas — ideal para uso personal o compartido, asegurando que tus activos permanezcan seguros y accesibles solo para ti.
fi: Vahvista lompakkosi monivaiheisilla hyväksymisillä parannettua suojausta varten — ihanteellinen henkilökohtaiseen tai jaettuun käyttöön, varmistaen että omaisuutesi pysyy turvassa ja saatavilla vain sinulle.
fr: Renforcez votre portefeuille avec des transactions à approbations multiples pour une protection accrue contre les menaces — idéal pour un usage personnel ou partagé, garantissant que vos actifs restent sécurisés et accessibles uniquement par vous.
pt: Reforce sua carteira com transações de múltiplas aprovações para maior proteção contra ameaças — ideal para uso pessoal ou compartilhado, garantindo que seus ativos permaneçam seguros e acessíveis apenas a você.

source: Frequently Asked Questions
ar: الأسئلة الشائعة
es: Preguntas Frecuentes
fi: Usein kysytyt kysymykset
fr: Questions Fréquemment Posées
pt: Perguntas Frequentes

source: General Questions
ar: الأسئلة العامة
es: Preguntas Generales
fi: Yleiset kysymykset
fr: Questions Générales
pt: Perguntas Gerais

source: Get in touch with our support team for assistance
ar: تواصل مع فريق الدعم لدينا للحصول على المساعدة
es: Ponte en contacto con nuestro equipo de soporte para obtener ayuda
fi: Ota yhteyttä tukitiimiimme apua varten
fr: Contactez notre équipe de support pour obtenir de l'aide
pt: Entre em contato com nossa equipe de suporte para assistência

source: Get it from
ar: احصل عليه من
es: Obtener desde
fi: Hanki se
fr: Obtenir depuis
pt: Obter de

source: How can I contact support?
ar: كيف يمكنني الاتصال بالدعم؟
es: ¿Cómo puedo contactar al soporte?
fi: Miten voin ottaa yhteyttä tukeen?
fr: Comment puis-je contacter le support ?
pt: Como posso entrar em contato com o suporte?

source: How do I backup my wallet?
ar: كيف أقوم بنسخ محفظتي احتياطيًا؟
es: ¿Cómo hago una copia de seguridad de mi billetera?
fi: Miten varmuuskopioin lompakkoni?
fr: Comment sauvegarder mon portefeuille ?
pt: Como faço backup da minha carteira?

source: How do I change my password?
ar: كيف أقوم بتغيير كلمة المرور؟
es: ¿Cómo cambio mi contraseña?
fi: Miten vaihdan salasanani?
fr: Comment changer mon mot de passe ?
pt: Como altero minha senha?

source: How do I delete my wallet?
ar: كيف أقوم بحذف محفظتي؟
es: ¿Cómo elimino mi billetera?
fi: Miten poistan lompakkoni?
fr: Comment supprimer mon portefeuille ?
pt: Como excluo minha carteira?

source: How do I get started with TBC Wallet?
ar: كيف أبدأ مع محفظة TBC؟
fi: Miten aloitan TBC Walletin käytön?
pt: Como começo a usar o TBC Wallet?

source: How do I update TBC Wallet?
ar: كيف أقوم بتحديث محفظة TBC؟
fi: Miten päivitän TBC Walletin?
pt: Como atualizo o TBC Wallet?

source: How does Instant Transfer work?
ar: كيف يعمل التحويل الفوري؟
es: ¿Cómo funciona la Transferencia Instantánea?
fi: Miten Pikasiirto toimii?
fr: Comment fonctionne le Transfert Instantané ?
pt: Como funciona a Transferência Instantânea?

source: How long do transactions take?
ar: كم تستغرق المعاملات؟
es: ¿Cuánto tardan las transacciones?
fi: Kuinka kauan tapahtumat kestävät?
fr: Combien de temps prennent les transactions ?
pt: Quanto tempo as transações levam?

source: How secure is TBC Wallet?
ar: ما مدى أمان محفظة TBC؟
fi: Kuinka turvallinen TBC Wallet on?
pt: Quão seguro é o TBC Wallet?

source: I can't see my balance. What's wrong?
ar: لا أستطيع رؤية رصيدي. ما المشكلة؟
es: No puedo ver mi saldo. ¿Qué está mal?
fi: En näe saldoani. Mikä on vikana?
fr: Je ne peux pas voir mon solde. Quel est le problème ?
pt: Não consigo ver meu saldo. O que está errado?

source: If a transaction fails: 1. Check your network connection. 2. Verify you have sufficient balance for fees. 3. Try increasing the transaction fee. 4. Contact support if the issue persists.
ar: إذا فشلت المعاملة: 1. تحقق من اتصالك بالشبكة. 2. تأكد من أن لديك رصيدًا كافيًا للرسوم. 3. حاول زيادة رسوم المعاملة. 4. اتصل بالدعم إذا استمرت المشكلة.
es: Si una transacción falla: 1. Verifica tu conexión de red. 2. Confirma que tienes saldo suficiente para las tarifas. 3. Intenta aumentar la tarifa de transacción. 4. Contacta al soporte si el problema persiste.
fi: Jos tapahtuma epäonnistuu: 1. Tarkista verkkoyhteytesi. 2. Varmista, että sinulla on riittävä saldo maksuihin. 3. Kokeile lisätä tapahtumamaksua. 4. Ota yhteyttä tukeen, jos ongelma jatkuu.
fr: Si une transaction échoue : 1. Vérifiez votre connexion réseau. 2. Vérifiez que vous avez un solde suffisant pour les frais. 3. Essayez d'augmenter les frais de transaction. 4. Contactez le support si le problème persiste.
pt: Se uma transação falhar: 1. Verifique sua conexão de rede. 2. Confirme que você tem saldo suficiente para as taxas. 3. Tente aumentar a taxa de transação. 4. Entre em contato com o suporte se o problema persistir.

source: If you lose your device: 1. Use your recovery phrase on a new device to restore your wallet. 2. Immediately transfer funds to a new wallet if possible. 3. Contact support if you need assistance. 4. Never share your recovery phrase with anyone.
ar: إذا فقدت جهازك: 1. استخدم عبارة الاسترداد على جهاز جديد لاستعادة محفظتك. 2. انقل الأموال فورًا إلى محفظة جديدة إن أمكن. 3. اتصل بالدعم إذا كنت بحاجة إلى مساعدة. 4. لا تشارك عبارة الاسترداد مع أي شخص أبدًا.
es: Si pierdes tu dispositivo: 1. Usa tu frase de recuperación en un nuevo dispositivo para restaurar tu billetera. 2. Transfiere fondos inmediatamente a una nueva billetera si es posible. 3. Contacta al soporte si necesitas ayuda. 4. Nunca compartas tu frase de recuperación con nadie.
fi: Jos kadotat laitteesi: 1. Käytä palautuslauseesi uudella laitteella palauttaaksesi lompakkosi. 2. Siirrä varat välittömästi uuteen lompakkoon, jos mahdollista. 3. Ota yhteyttä tukeen, jos tarvitset apua. 4. Älä koskaan jaa palautuslauseesi kenellekään.
fr: Si vous perdez votre appareil : 1. Utilisez votre phrase de récupération sur un nouvel appareil pour restaurer votre portefeuille. 2. Transférez immédiatement les fonds vers un nouveau portefeuille si possible. 3. Contactez le support si vous avez besoin d'aide. 4. Ne partagez jamais votre phrase de récupération avec qui que ce soit.
pt: Se você perder seu dispositivo: 1. Use sua frase de recuperação em um novo dispositivo para restaurar sua carteira. 2. Transfira imediatamente os fundos para uma nova carteira, se possível. 3. Entre em contato com o suporte se precisar de ajuda. 4. Nunca compartilhe sua frase de recuperação com ninguém.

source: If your balance isn't showing: 1. Check your internet connection. 2. Refresh the wallet. 3. Verify you're on the correct network. 4. Check if the transaction was successful on a blockchain explorer.
ar: إذا لم يظهر رصيدك: 1. تحقق من اتصالك بالإنترنت. 2. قم بتحديث المحفظة. 3. تأكد من أنك على الشبكة الصحيحة. 4. تحقق من نجاح المعاملة على مستكشف البلوك تشين.
es: Si tu saldo no se muestra: 1. Verifica tu conexión a internet. 2. Actualiza la billetera. 3. Confirma que estás en la red correcta. 4. Verifica si la transacción fue exitosa en un explorador de blockchain.
fi: Jos saldosi ei näy: 1. Tarkista internetyhteytesi. 2. Päivitä lompakko. 3. Varmista, että olet oikealla verkolla. 4. Tarkista, onko tapahtuma onnistunut lohkoketjuesploraattorissa.
fr: Si votre solde ne s'affiche pas : 1. Vérifiez votre connexion Internet. 2. Actualisez le portefeuille. 3. Vérifiez que vous êtes sur le bon réseau. 4. Vérifiez si la transaction a réussi sur un explorateur de blockchain.
pt: Se seu saldo não estiver aparecendo: 1. Verifique sua conexão com a internet. 2. Atualize a carteira. 3. Confirme que você está na rede correta. 4. Verifique se a transação foi bem-sucedida em um explorador de blockchain.

source: Instant transfer
ar: تحويل فوري
es: Transferencia instantánea
fi: Välitön siirto
fr: Transfert instantané
pt: Transferência instantânea

source: Instant Transfer enables fast cross-chain transactions with minimal fees. It uses advanced cross-chain protocols to transfer assets between different blockchain networks almost instantly.
ar: التحويل الفوري يمكّن من المعاملات السريعة عبر السلاسل برسوم minimal. يستخدم بروتوكولات cross-chain متقدمة لنقل الأصول بين شبكات البلوك تشين المختلفة تقريبًا فورًا.
es: La Transferencia Instantánea permite transacciones rápidas entre cadenas con tarifas mínimas. Utiliza protocolos avanzados entre cadenas para transferir activos entre diferentes redes blockchain casi instantáneamente.
fi: Pikasiirto mahdollistaa nopeat ketjujenväliset tapahtumat minimaalisilla maksuilla. Se käyttää kehittyneitä ketjujenvälisiä protokollia siirtääkseen varoja eri lohkoketjeverkkojen välillä lähes hetkessä.
fr: Le Transfert Instantané permet des transactions rapides entre chaînes avec des frais minimes. Il utilise des protocoles avancés entre chaînes pour transférer des actifs entre différentes réseaux blockchain presque instantanément.
pt: A Transferência Instantânea permite transações rápidas entre cadeias com taxas mínimas. Ela usa protocolos avançados entre cadeias para transferir ativos entre diferentes redes blockchain quase instantaneamente.

source: iOS app
ar: تطبيق iOS
es: Aplicación para iOS
fi: iOS-sovellus
fr: Application iOS
pt: Aplicativo iOS

source: Is TBC Wallet free to use?
ar: هل محفظة TBC مجانية للاستخدام؟
fi: Onko TBC Wallet ilmainen käyttää?
pt: O TBC Wallet é gratuito para usar?

source: MacOS app
ar: تطبيق MacOS
es: Aplicación para MacOS
fi: MacOS-sovellus
fr: Application MacOS
pt: Aplicativo MacOS

source: Miner
ar: منقّب
es: Minero
fi: Lohkonlouhija
fr: Mineur
pt: Minerador

source: Missing brand icon for
ar: أيقونة العلامة مفقودة لـ
es: Falta el ícono de la marca para
fi: Puuttuva brändikuvake kohteelle
fr: Icône de marque manquante pour
pt: Ícone de marca ausente para

source: Mobile app
ar: تطبيق الهاتف الجوال
es: Aplicación móvil
fi: Mobiilisovellus
fr: Application mobile
pt: Aplicativo móvel

source: Multi signature
ar: توقيع متعدد
es: Firma múltiple
fi: Moniallekirjoitus
pt: Assinatura múltipla

source: Multi-signature (multi-sig) requires multiple approvals before a transaction can be executed. This adds an extra layer of security, ideal for shared wallets or high-value accounts.
ar: التوقيع المتعدد (multi-sig) يتطلب موافقات متعددة قبل تنفيذ المعاملة. يضيف هذا طبقة إضافية من الأمان، مثالية للمحافظ المشتركة أو الحسابات عالية القيمة.
es: La firma múltiple (multi-sig) requiere múltiples aprobaciones antes de que se pueda ejecutar una transacción. Esto añade una capa adicional de seguridad, ideal para billeteras compartidas o cuentas de alto valor.
fi: Moniallekirjoitus (multi-sig) vaatii useita hyväksyntöjä ennen kuin tapahtuma voidaan suorittaa. Tämä lisää ylimääräisen turvallisuuskerroksen, ihanteellinen jaetuille lompakoille tai korkean arvon tileille.
fr: La signature multiple (multi-sig) nécessite plusieurs approbations avant qu'une transaction puisse être exécutée. Cela ajoute une couche supplémentaire de sécurité, idéale pour les portefeuilles partagés ou les comptes à valeur élevée.
pt: A assinatura múltipla (multi-sig) requer múltiplas aprovações antes que uma transação possa ser executada. Isso adiciona uma camada extra de segurança, ideal para carteiras compartilhadas ou contas de alto valor.

source: My transaction failed. What should I do?
ar: فشلت معاملتي. ماذا يجب أن أفعل؟
es: Mi transacción falló. ¿Qué debo hacer?
fi: Tapahtumani epäonnistui. Mitä minun pitäisi tehdä?
fr: Ma transaction a échoué. Que dois-je faire ?
pt: Minha transação falhou. O que devo fazer?

source: No language found.
ar: لم يتم العثور على لغة.
es: No se encontró ningún idioma.
fi: Kieltä ei löytynyt.
fr: Aucune langue trouvée.
pt: Nenhum idioma encontrado.

source: No, TBC Wallet cannot access your funds. Your private keys are stored locally on your device and are never transmitted to our servers. You have complete control over your assets.
ar: لا، لا يمكن لمحفظة TBC الوصول إلى أموالك. يتم تخزين المفاتيح الخاصة محليًا على جهازك ولا يتم إرسالها إلى خوادمنا أبدًا. لديك سيطرة كاملة على أصولك.
fi: Ei, TBC Wallet ei voi käyttää varojasi. Yksityiset avaimesi tallennetaan paikallisesti laitteellesi eikä niitä koskaan lähetetä palvelimillemme. Sinulla on täysi valvonta varojasi.
pt: Não, o TBC Wallet não pode acessar seus fundos. Suas chaves privadas são armazenadas localmente no seu dispositivo e nunca são transmitidas para nossos servidores. Você tem controle total sobre seus ativos.

source: Once a transaction is confirmed on the blockchain, it cannot be cancelled. Always verify transaction details before confirming.
ar: بمجرد تأكيد المعاملة على البلوك تشين، لا يمكن إلغاؤها. تحقق دائمًا من تفاصيل المعاملة قبل التأكيد.
es: Una vez que una transacción se confirma en la blockchain, no se puede cancelar. Siempre verifica los detalles de la transacción antes de confirmar.
fi: Kun tapahtuma on vahvistettu lohkoketjussa, sitä ei voi peruuttaa. Tarkista aina tapahtuman tiedot ennen vahvistamista.
fr: Une fois qu'une transaction est confirmée sur la blockchain, elle ne peut pas être annulée. Vérifiez toujours les détails de la transaction avant de confirmer.
pt: Uma vez que uma transação é confirmada na blockchain, ela não pode ser cancelada. Sempre verifique os detalhes da transação antes de confirmar.

source: One wallet. Cross platform
ar: محفظة واحدة. عبر المنصات
es: Una billetera. Multiplataforma
fi: Yksi lompakko. Monialustainen
fr: Un seul portefeuille. Multi-plateforme
pt: Uma carteira. Multiplataforma
