Repository: LVIPHU/officialwalletweb
Catalog: src/i18n/locales/*/messages.po
Languages: ar, es, fi, fr, pt

source: Why is my transaction pending?
ar: لماذا معاملتي معلقة؟
es: ¿Por qué mi transacción está pendiente?
fi: Miksi tapahtumani on odottamassa?
fr: Pourquoi ma transaction est-elle en attente ?
pt: Por que minha transação está pendente?

source: Windows app
ar: تطبيق ويندوز
es: Aplicación para Windows
fi: Windows-sovellus
fr: Application Windows
pt: Aplicativo Windows

source: Yes, TBC Wallet is free to download and use. However, blockchain networks charge transaction fees for processing transactions, which are standard across all wallets.
ar: نعم، محفظة TBC مجانية للتنزيل والاستخدام. ومع ذلك، تفرض شبكات البلوك تشين رسوم معاملات لمعالجة المعاملات، وهي معيارية في جميع المحافظ.
fi: Kyllä, TBC Wallet on ilmainen ladata ja käyttää. Lohkoketjeverkot veloittavat kuitenkin tapahtumamaksuja tapahtumien käsittelystä, mikä on standardi kaikissa lompakoissa.
pt: Sim, o TBC Wallet é gratuito para baixar e usar. No entanto, as redes blockchain cobram taxas de transação para processar transações, o que é padrão em todas as carteiras.

source: Yes, TBC Wallet supports paying transaction fees with USDT (Tether), providing price stability and predictability, especially valuable during volatile market conditions.
ar: نعم، تدعم محفظة TBC دفع رسوم المعاملات بـ USDT (Tether)، مما يوفر استقرارًا وتوقعًا للأسعار، خاصةً قيمة خلال ظروف السوق المتقلبة.
fi: Kyllä, TBC Wallet tukee tapahtumamaksujen maksamista USDT:llä (Tether), tarjoten hintavakautta ja ennakoitavuutta, erityisen arvokasta epävakaiden markkinaolosuhteiden aikana.
pt: Sim, o TBC Wallet suporta o pagamento de taxas de transação com USDT (Tether), fornecendo estabilidade e previsibilidade de preços, especialmente valioso durante condições de mercado voláteis.

source: Yes, we provide comprehensive tutorials and guides on: Setting up your wallet, Making transactions, Using advanced features, Security best practices. For more information, visit our Support Center or check our documentation.
ar: نعم، نقدم دروسًا تعليمية وأدلة شاملة حول: إعداد محفظتك، إجراء المعاملات، استخدام الميزات المتقدمة، أفضل ممارسات الأمان. لمزيد من المعلومات، قم بزيارة مركز الدعم لدينا أو تحقق من وثائقنا.
es: Sí, proporcionamos tutoriales y guías completas sobre: Configurar tu billetera, Realizar transacciones, Usar funciones avanzadas, Mejores prácticas de seguridad. Para más información, visita nuestro Centro de Soporte o consulta nuestra documentación.
fi: Kyllä, tarjoamme kattavia opetusohjelmia ja oppaita: Lompakon asettaminen, Tapahtumien tekeminen, Kehittyneiden ominaisuuksien käyttö, Turvallisuuden parhaat käytännöt. Lisätietoja varten vieraile Tukikeskuksessamme tai tarkista dokumentaatiomme.
fr: Oui, nous fournissons des tutoriels et guides complets sur : Configuration de votre portefeuille, Réalisation de transactions, Utilisation des fonctionnalités avancées, Meilleures pratiques de sécurité. Pour plus d'informations, visitez notre Centre de Support ou consultez notre documentation.
pt: Sim, fornecemos tutoriais e guias abrangentes sobre: Configurar sua carteira, Fazer transações, Usar recursos avançados, Melhores práticas de segurança. Para mais informações, visite nosso Centro de Suporte ou consulte nossa documentação.

source: Yes, you can create and manage multiple wallets within TBC Wallet. Each wallet has its own recovery phrase and private keys.
ar: نعم، يمكنك إنشاء وإدارة محافظ متعددة داخل محفظة TBC. كل محفظة لها عبارة الاسترداد والمفاتيح الخاصة بها.
fi: Kyllä, voit luoda ja hallita useita lompakoita TBC Walletissa. Jokaisella lompakolla on oma palautuslauseensa ja yksityiset avaimensa.
pt: Sim, você pode criar e gerenciar várias carteiras dentro do TBC Wallet. Cada carteira tem sua própria frase de recuperação e chaves privadas.

source: You can reach us through: Email: contact@tbchatofficial.com, Support Center: Visit our Contact Us page, Social Media: Follow us on X, Telegram, and Discord.
ar: يمكنك الوصول إلينا من خلال: البريد الإلكتروني: contact@tbchatofficial.com، مركز الدعم: قم بزيارة صفحة اتصل بنا، وسائل التواصل الاجتماعي: تابعنا على X و Telegram و Discord.
es: Puedes contactarnos a través de: Correo electrónico: contact@tbchatofficial.com, Centro de Soporte: Visita nuestra página Contáctanos, Redes Sociales: Síguenos en X, Telegram y Discord.
fi: Voit ottaa meihin yhteyttä: Sähköposti: contact@tbchatofficial.com, Tukikeskus: Vieraile Ota yhteyttä -sivullamme, Sosiaalinen media: Seuraa meitä X:ssä, Telegramissa ja Discordissa.
fr: Vous pouvez nous contacter via : Email : contact@tbchatofficial.com, Centre de Support : Visitez notre page Contactez-nous, Réseaux Sociaux : Suivez-nous sur X, Telegram et Discord.
pt: Você pode nos contatar através de: Email: contact@tbchatofficial.com, Centro de Suporte: Visite nossa página Entre em Contato, Redes Sociais: Siga-nos no X, Telegram e Discord.

source: Your All-in-One Web3 Wallet
ar: محفظتك الشاملة لكل ما يتعلق بـ Web3
es: Tu billetera Web3 todo en uno
fi: Kaikki-yhdessä Web3-lompakkosi
fr: Votre portefeuille Web3 tout-en-un
pt: Sua carteira Web3 tudo-em-um

source: Your privacy matters, learn how we protect it
ar: خصوصيتك مهمة، تعلم كيف نحميها
es: Tu privacidad es importante, aprende cómo la protegemos
fi: Yksityisyytesi on tärkeä, opi miten suojaamme sitä
fr: Votre vie privée compte, découvrez comment nous la protégeons
pt: Sua privacidade importa, saiba como a protegemos

source: Effortlessly exchange tokens across chains with low fees and real-time rates. Whether trading Bitcoin for TRON or optimizing your portfolio, TBC Wallet makes swaps quick and intuitive.
fi: Vaihda tokeneita ketjujen välillä vaivattomasti alhaisilla kuluilla ja reaaliaikaisilla kursseilla. Olitpa vaihtamassa Bitcoinia TRONan tai optimoimassa portfoliosi, TBC Wallet tekee vaihdosta nopeaa ja intuitiivista.
pt: Troque tokens entre cadeias com facilidade, taxas baixas e cotações em tempo real. Seja trocando Bitcoin por TRON ou otimizando seu portfólio, a TBC Wallet torna as trocas rápidas e intuitivas.

source: Home
es: Inicio
fi: Koti
fr: Accueil
pt: Início

source: name@email.com
es: nombre@correo.com
fi: nimi@sahkoposti.com
fr: nom@email.com
pt: nome@email.com

source: TBC Wallet empowers you to manage diverse assets like Bitcoin, Ethereum, and TRON. Securely dive into DeFi, NFTs, and dApps with full control. Your keys, your future.
fi: TBC Wallet antaa sinulle mahdollisuuden hallita erilaisia varoja kuten Bitcoinia, Ethereumia ja TRONa. Sukella turvallisesti DeFiin, NFT:ihin ja dAppsien maailmaan täydellä kontrollilla. Avaimesi, tulevaisuutesi.
pt: A TBC Wallet capacita você a gerenciar ativos variados como Bitcoin, Ethereum e TRON. Mergulhe com segurança em DeFi, NFTs e dApps com controle total. Suas chaves, seu futuro.

source: TBC Wallet is a secure, multi-chain cryptocurrency wallet that supports multiple blockchain networks including TBChain, Bitcoin, Ethereum, and TRON. It provides a user-friendly interface for managing digital assets, executing transactions, and accessing DeFi services.
fi: TBC Wallet on turvallinen moniketjuinen kryptovaluuttalompakko, joka tukee useita lohkoketjeverkkoja, mukaan lukien TBChain, Bitcoin, Ethereum ja TRON. Se tarjoaa käyttäjäystävällisen käyttöliittymän digitaalisten varojen hallintaan, tapahtumien suorittamiseen ja DeFi-palveluiden käyttöön.
pt: O TBC Wallet é uma carteira de criptomoedas segura e multi-cadeia que suporta múltiplas redes blockchain, incluindo TBChain, Bitcoin, Ethereum e TRON. Ele fornece uma interface amigável para gerenciar ativos digitais, executar transações e acessar serviços DeFi.

source: TBC Wallet supports: TBChain (native network), Bitcoin, Ethereum and EVM-compatible chains, TRON, And more networks continuously being added.
fi: TBC Wallet tukee: TBChain (alkuperäinen verkko), Bitcoin, Ethereum ja EVM-yhteensopivat ketjut, TRON, ja lisää verkkoja lisätään jatkuvasti.
pt: O TBC Wallet suporta: TBChain (rede nativa), Bitcoin, Ethereum e cadeias compatíveis com EVM, TRON, e mais redes sendo adicionadas continuamente.

source: Transaction times vary by network: TBChain: Usually completes in seconds. Bitcoin: 10-60 minutes depending on network congestion. Ethereum: 15 seconds to several minutes. TRON: Usually completes in under a minute.
es: Los tiempos de transacción varían según la red: TBChain: Generalmente se completa en segundos. Bitcoin: 10-60 minutos dependiendo de la congestión de red. Ethereum: 15 segundos a varios minutos. TRON: Generalmente se completa en menos de un minuto.
fi: Tapahtuma-ajat vaihtelevat verkon mukaan: TBChain: Yleensä valmistuu sekunneissa. Bitcoin: 10-60 minuuttia verkon ruuhkaisuudesta riippuen. Ethereum: 15 sekuntia useisiin minuutteihin. TRON: Yleensä valmistuu alle minuutissa.
fr: Les temps de transaction varient selon le réseau : TBChain : Se termine généralement en quelques secondes. Bitcoin : 10-60 minutes selon la congestion du réseau. Ethereum : 15 secondes à plusieurs minutes. TRON : Se termine généralement en moins d'une minute.
pt: Os tempos de transação variam por rede: TBChain: Geralmente completa em segundos. Bitcoin: 10-60 minutos dependendo do congestionamento da rede. Ethereum: 15 segundos a vários minutos. TRON: Geralmente completa em menos de um minuto.

source: 1. Download TB Wallet from the App Store, Google Play, or our website. 2. Create a new wallet or import an existing one. 3. Secure your wallet with a strong password and backup your recovery phrase. 4. Start managing your digital assets.
es: 1. Descarga TB Wallet desde App Store, Google Play o nuestro sitio web. 2. Crea una nueva billetera o importa una existente. 3. Protege tu billetera con una contraseña segura y haz una copia de seguridad de tu frase de recuperación. 4. Comienza a gestionar tus activos digitales.
fr: 1. Téléchargez TB Wallet depuis l'App Store, Google Play ou notre site web. 2. Créez un nouveau portefeuille ou importez-en un existant. 3. Sécurisez votre portefeuille avec un mot de passe fort et sauvegardez votre phrase de récupération. 4. Commencez à gérer vos actifs numériques.

source: Boost earnings by connecting to mining pools and tracking rewards in-app. TB Wallet simplifies mining management, helping both new and seasoned users maximize returns securely.
es: Incrementa tus ganancias conectándote a pools de minería y siguiendo recompensas en la app. TB Wallet simplifica la gestión de minería, ayudando tanto a usuarios nuevos como experimentados a maximizar retornos de forma segura.
fr: Augmentez vos gains en vous connectant à des pools de minage et en suivant les récompenses dans l’application. TB Wallet simplifie la gestion du minage, aidant aussi bien les nouveaux utilisateurs que les expérimentés à maximiser leurs rendements en toute sécurité.

source: Can TB Wallet access my funds?
es: ¿Puede TB Wallet acceder a mis fondos?
fr: TB Wallet peut-il accéder à mes fonds ?

source: Effortlessly exchange tokens across chains with low fees and real-time rates. Whether trading Bitcoin for TRON or optimizing your portfolio, TB Wallet makes swaps quick and intuitive.
es: Intercambia tokens entre cadenas sin esfuerzo, con tarifas bajas y tasas en tiempo real. Ya sea que intercambies Bitcoin por TRON o optimices tu cartera, TB Wallet hace que los cambios sean rápidos e intuitivos.
fr: Échangez des tokens entre chaînes sans effort, avec des frais réduits et des taux en temps réel. Que vous échangiez du Bitcoin contre du TRON ou optimisiez votre portefeuille, TB Wallet rend les échanges rapides et intuitifs.

source: Find answers to frequently asked questions about TB Wallet
es: Encuentra respuestas a preguntas frecuentes sobre TB Wallet
fr: Trouvez des réponses aux questions fréquemment posées sur TB Wallet

source: How do I get started with TB Wallet?
es: ¿Cómo empiezo con TB Wallet?
fr: Comment commencer avec TB Wallet ?

source: How do I update TB Wallet?
es: ¿Cómo actualizo TB Wallet?
fr: Comment mettre à jour TB Wallet ?

source: How secure is TB Wallet?
es: ¿Qué tan segura es TB Wallet?
fr: Quelle est la sécurité de TB Wallet ?

source: Is TB Wallet free to use?
es: ¿Es TB Wallet gratis de usar?
fr: TB Wallet est-il gratuit à utiliser ?

source: No, TB Wallet cannot access your funds. Your private keys are stored locally on your device and are never transmitted to our servers. You have complete control over your assets.
es: No, TB Wallet no puede acceder a tus fondos. Tus claves privadas se almacenan localmente en tu dispositivo y nunca se transmiten a nuestros servidores. Tienes control completo sobre tus activos.
fr: Non, TB Wallet ne peut pas accéder à vos fonds. Vos clés privées sont stockées localement sur votre appareil et ne sont jamais transmises à nos serveurs. Vous avez un contrôle total sur vos actifs.

source: Send assets across chains with near-zero delays and minimal costs. TB Wallet ensures fast, reliable transactions for everyday use, from peer-to-peer sends to dApp funding.
es: Envía activos entre cadenas con retrasos casi nulos y costos mínimos. TB Wallet garantiza transacciones rápidas y confiables para el uso diario, desde envíos entre pares hasta financiación de dApps.
fr: Envoyez des actifs entre chaînes avec des délais quasi nuls et des coûts minimaux. TB Wallet garantit des transactions rapides et fiables pour un usage quotidien, des envois pair à pair au financement de dApps.

source: TB Wallet bridges the gap for beginners and experts alike. Its user-friendly design offers easy onboarding for newcomers and advanced tools for DeFi pros, ensuring secure, efficient navigation of the decentralized ecosystem.
es: TB Wallet cierra la brecha entre principiantes y expertos por igual. Su diseño intuitivo ofrece una incorporación fácil para los nuevos y herramientas avanzadas para los profesionales de DeFi, garantizando una navegación segura y eficiente en el ecosistema descentralizado.
fr: TB Wallet comble le fossé entre débutants et experts. Son design convivial offre un onboarding fluide pour les nouveaux venus et des outils avancés pour les professionnels de la DeFi, garantissant une navigation sécurisée et efficace dans l’écosystème décentralisé.

source: TB Wallet connects you to diverse ecosystems, from Bitcoin and Ethereum to Optimism and Cosmos. Manage portfolios, engage in DeFi, trade NFTs, and link to dApps—all in one secure, self-custody hub.
es: TB Wallet te conecta con ecosistemas diversos, desde Bitcoin y Ethereum hasta Optimism y Cosmos. Gestiona carteras, participa en DeFi, comercia NFTs y enlaza con dApps, todo en un centro seguro de autocustodia.
fr: TB Wallet vous connecte à des écosystèmes variés, de Bitcoin et Ethereum à Optimism et Cosmos. Gérez vos portefeuilles, participez à la DeFi, échangez des NFTs et accédez aux dApps — le tout dans un hub sécurisé et auto-géré.

source: TB Wallet employs multiple security layers: Encrypted Storage: All private keys are encrypted and stored locally on your device. Multi-Signature Support: Enhanced security for high-value transactions. Biometric Authentication: Fingerprint and face recognition support. Regular Security Updates: Continuous security improvements.
es: TB Wallet emplea múltiples capas de seguridad: Almacenamiento Encriptado: Todas las claves privadas están encriptadas y almacenadas localmente en tu dispositivo. Soporte de Firma Múltiple: Seguridad mejorada para transacciones de alto valor. Autenticación Biométrica: Soporte para huella dactilar y reconocimiento facial. Actualizaciones de Seguridad Regulares: Mejoras continuas de seguridad.
fr: TB Wallet utilise plusieurs couches de sécurité : Stockage Chiffré : Toutes les clés privées sont chiffrées et stockées localement sur votre appareil. Support de Signature Multiple : Sécurité renforcée pour les transactions à valeur élevée. Authentification Biométrique : Support de l'empreinte digitale et de la reconnaissance faciale. Mises à Jour de Sécurité Régulières : Améliorations continues de la sécurité.

source: TB Wallet empowers you to manage diverse assets like Bitcoin, Ethereum, and TRON. Securely dive into DeFi, NFTs, and dApps with full control. Your keys, your future.
es: TB Wallet te empodera para gestionar activos diversos como Bitcoin, Ethereum y TRON. Sumérgete con seguridad en DeFi, NFTs y dApps con control total. Tus claves, tu futuro.
fr: TB Wallet vous permet de gérer des actifs variés comme Bitcoin, Ethereum et TRON. Plongez en toute sécurité dans la DeFi, les NFTs et les dApps avec un contrôle total. Vos clés, votre avenir.

source: TB Wallet is a leading multi-chain wallet with robust security and an intuitive interface. It simplifies Web3 interactions, from token management to dApp access, while giving you total control over your digital wealth.
es: TB Wallet es una billetera multichain líder con seguridad robusta e interfaz intuitiva. Simplifica las interacciones Web3, desde la gestión de tokens hasta el acceso a dApps, dándote control total sobre tu riqueza digital.
fr: TB Wallet est un portefeuille multi-chaînes de premier plan, doté d’une sécurité renforcée et d’une interface intuitive. Il simplifie les interactions Web3, de la gestion des tokens à l’accès aux dApps, tout en vous donnant un contrôle total sur votre richesse numérique.

source: TB Wallet is a secure, multi-chain cryptocurrency wallet that supports multiple blockchain networks including TBChain, Bitcoin, Ethereum, and TRON. It provides a user-friendly interface for managing digital assets, executing transactions, and accessing DeFi services.
es: TB Wallet es una billetera de criptomonedas segura y multi-cadena que admite múltiples redes blockchain, incluyendo TBChain, Bitcoin, Ethereum y TRON. Proporciona una interfaz fácil de usar para gestionar activos digitales, ejecutar transacciones y acceder a servicios DeFi.
fr: TB Wallet est un portefeuille de cryptomonnaies sécurisé et multi-chaînes qui prend en charge plusieurs réseaux blockchain, notamment TBChain, Bitcoin, Ethereum et TRON. Il offre une interface conviviale pour gérer les actifs numériques, exécuter des transactions et accéder aux services DeFi.

source: TB Wallet is available on: Mobile: iOS and Android applications, Desktop: Windows and MacOS applications, Browser: Browser extension for Chrome, Firefox, and Edge.
es: TB Wallet está disponible en: Móvil: aplicaciones iOS y Android, Escritorio: aplicaciones Windows y MacOS, Navegador: extensión del navegador para Chrome, Firefox y Edge.
fr: TB Wallet est disponible sur : Mobile : applications iOS et Android, Bureau : applications Windows et MacOS, Navigateur : extension de navigateur pour Chrome, Firefox et Edge.

source: TB Wallet supports: TBChain (native network), Bitcoin, Ethereum and EVM-compatible chains, TRON, And more networks continuously being added.
es: TB Wallet admite: TBChain (red nativa), Bitcoin, Ethereum y cadenas compatibles con EVM, TRON, y más redes que se añaden continuamente.
fr: TB Wallet prend en charge : TBChain (réseau natif), Bitcoin, Ethereum et les chaînes compatibles EVM, TRON, et d'autres réseaux ajoutés en continu.

source: What is TB Wallet?
es: ¿Qué es TB Wallet?
fr: Qu'est-ce que TB Wallet ?

source: Where can I learn more about TB Wallet?
es: ¿Dónde puedo aprender más sobre TB Wallet?
fr: Où puis-je en savoir plus sur TB Wallet ?

source: Which platforms does TB Wallet support?
es: ¿Qué plataformas admite TB Wallet?
fr: Quelles plateformes TB Wallet prend-il en charge ?

source: Yes, TB Wallet is free to download and use. However, blockchain networks charge transaction fees for processing transactions, which are standard across all wallets.
es: Sí, TB Wallet es gratuito de descargar y usar. Sin embargo, las redes blockchain cobran tarifas de transacción por procesar transacciones, lo cual es estándar en todas las billeteras.
fr: Oui, TB Wallet est gratuit à télécharger et à utiliser. Cependant, les réseaux blockchain facturent des frais de transaction pour le traitement des transactions, ce qui est standard pour tous les portefeuilles.

source: Yes, TB Wallet supports paying transaction fees with USDT (Tether), providing price stability and predictability, especially valuable during volatile market conditions.
es: Sí, TB Wallet admite pagar tarifas de transacción con USDT (Tether), proporcionando estabilidad y previsibilidad de precios, especialmente valioso durante condiciones de mercado volátiles.
fr: Oui, TB Wallet prend en charge le paiement des frais de transaction avec USDT (Tether), offrant stabilité et prévisibilité des prix, particulièrement précieux pendant les conditions de marché volatiles.

source: Yes, you can create and manage multiple wallets within TB Wallet. Each wallet has its own recovery phrase and private keys.
es: Sí, puedes crear y gestionar múltiples billeteras dentro de TB Wallet. Cada billetera tiene su propia frase de recuperación y claves privadas.
fr: Oui, vous pouvez créer et gérer plusieurs portefeuilles dans TB Wallet. Chaque portefeuille a sa propre phrase de récupération et ses clés privées.
