Repository: LVIPHU/officialwalletweb
Catalog: src/i18n/locales/*/messages.po
Languages: ar, es, fi, fr, pt

source: Our support team is available 24/7 to assist you with any questions or issues.
ar: فريق الدعم لدينا متاح على مدار الساعة طوال أيام الأسبوع لمساعدتك في أي أسئلة أو مشاكل.
es: Nuestro equipo de soporte está disponible las 24 horas del día, los 7 días de la semana para ayudarte con cualquier pregunta o problema.
fi: Tukitiimimme on saatavilla 24/7 auttamaan sinua kaikissa kysymyksissä tai ongelmissa.
fr: Notre équipe de support est disponible 24h/24 et 7j/7 pour vous aider avec toutes vos questions ou problèmes.
pt: Nossa equipe de suporte está disponível 24/7 para ajudá-lo com quaisquer perguntas ou problemas.

source: Own Your Crypto.
ar: امتلك عملاتك الرقمية.
es: Sé dueño de tus criptomonedas.
fi: Omista kryptosi.
fr: Prenez le contrôle de votre crypto.
pt: Seja dono das suas criptomoedas.

source: Own Your Crypto. Unleash Web3 Possibilities
ar: امتلك عملاتك الرقمية. وأطلق العنان لإمكانيات Web3
es: Sé dueño de tus criptomonedas. Libera las posibilidades de Web3
fi: Omista kryptosi. Vapauta Web3-mahdollisuudet
fr: Prenez le contrôle de votre crypto. Libérez le potentiel du Web3
pt: Seja dono das suas criptomoedas. Liberte as possibilidades do Web3

source: Pay fees in USDT for stable, predictable costs amid market swings
ar: ادفع الرسوم بـ USDT لتكاليف مستقرة ومتوقّعة وسط تقلبات السوق
es: Paga tarifas en USDT para costos estables y predecibles ante las fluctuaciones del mercado
fi: Maksa palkkiot USDT:ssä vakaiden, ennakoitavissa olevien kustannusten vuoksi markkinoiden vaihteluiden keskellä
fr: Payez les frais en USDT pour des coûts stables et prévisibles malgré les fluctuations du marché
pt: Pague taxas em USDT para custos estáveis e previsíveis em meio às oscilações do mercado

source: Pay fees in USDT for stable, predictable costs amid market swings. This flexible feature adds transparency, making Web3 interactions more budget-friendly and user-centric.
ar: ادفع الرسوم بـ USDT لتكاليف مستقرة ومتوقّعة وسط تقلبات السوق. هذه الميزة المرنة تضيف شفافية وتجعل التعاملات في Web3 أكثر ملاءمة للميزانية وتركيزًا على المستخدم.
es: Paga tarifas en USDT para mantener costos estables y predecibles ante las fluctuaciones del mercado. Esta función flexible añade transparencia, haciendo las interacciones con Web3 más económicas y centradas en el usuario.
fi: Maksa palkkiot USDT:ssä vakaiden, ennakoitavissa olevien kustannusten vuoksi markkinoiden vaihteluiden keskellä. Tämä joustava ominaisuus lisää läpinäkyvyyttä ja tekee Web3-vuorovaikutuksesta budjettiystävällisempää ja käyttäjäkeskeistä.
fr: Payez les frais en USDT pour des coûts stables et prévisibles malgré les fluctuations du marché. Cette fonction flexible ajoute de la transparence, rendant les interactions Web3 plus économiques et centrées sur l’utilisateur.
pt: Pague taxas em USDT para custos estáveis e previsíveis em meio às oscilações do mercado. Este recurso flexível adiciona transparência, tornando as interações Web3 mais acessíveis e centradas no usuário.

source: Possibilities
ar: إمكانيات.
es: Posibilidades
fi: Mahdollisuudet
fr: Possibilités
pt: Possibilidades

source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
fi: Tietosuojakäytäntö
fr: Politique de confidentialité
pt: Política de privacidade

source: Security
ar: الأمان
es: Seguridad
fi: Turvallisuus
fr: Sécurité
pt: Segurança

source: Send assets across chains with near-zero delays and minimal costs
ar: أرسل الأصول عبر السلاسل بزمن تأخير شبه معدوم وتكاليف منخفضة
es: Envía activos entre cadenas con retrasos casi nulos y costos mínimos
fi: Lähetä varoja ketjujen välillä lähes nollaviiveellä ja minimaalisin kustannuksin
fr: Envoyez des actifs entre chaînes avec des délais quasi nuls et des coûts minimaux
pt: Envie ativos entre cadeias com atrasos quase nulos e custos mínimos

source: Send assets across chains with near-zero delays and minimal costs. TBC Wallet ensures fast, reliable transactions for everyday use, from peer-to-peer sends to dApp funding.
ar: أرسل الأصول عبر السلاسل بزمن تأخير شبه معدوم وتكاليف منخفضة. محفظة TB تضمن معاملات سريعة وموثوقة للاستخدام اليومي، من التحويلات الفردية إلى تمويل dApps.
fi: Lähetä varoja ketjujen välillä lähes nollaviiveellä ja minimaalisin kustannuksin. TBC Wallet varmistaa nopeat ja luotettavat transaktiot päivittäiseen käyttöön, vertaislähetyksistä dApp-rahoitukseen.
pt: Envie ativos entre cadeias com atrasos quase nulos e custos mínimos. A TBC Wallet garante transações rápidas e confiáveis para uso diário, desde envios peer-to-peer até o financiamento de dApps.

source: Sign up
ar: سجّل الآن
es: Registrarse
fi: Rekisteröidy
fr: S'inscrire
pt: Inscrever-se

source: Something incredible is on the horizon! Drop your email below to be first in line for early access.
ar: شيء مذهل يلوح في الأفق! أضف بريدك الإلكتروني أدناه لتكون أول من يحصل على الوصول المبكر.
es: ¡Algo increíble está por llegar! Deja tu correo electrónico abajo para ser el primero en obtener acceso anticipado.
fi: Jotain uskomatonta on tulossa! Jätä sähköpostisi alle, niin olet ensimmäisten joukossa saamassa varhaisen pääsyn.
fr: Quelque chose d’incroyable se prépare ! Entrez votre adresse e-mail ci-dessous pour être parmi les premiers à obtenir un accès anticipé.
pt: Algo incrível está a caminho! Deixe seu e-mail abaixo para ser o primeiro a ter acesso antecipado.

source: Stay connected:
ar: ابقَ متصلاً:
es: Mantente conectado:
fi: Pysy yhteydessä:
fr: Restez connecté :
pt: Mantenha-se conectado:

source: Support
ar: الدعم
es: Soporte
fi: Tuki
fr: Assistance
pt: Suporte

source: Swap
ar: المُبادلة
es: Intercambiar
fi: Vaihda
fr: Échange
pt: Troca

source: Swap securely and seamlessly
ar: المُبادلة بشكل آمن وسلس
es: Intercambia de forma segura y sin problemas
fi: Vaihda turvallisesti ja saumattomasti
fr: Échangez de manière sécurisée et transparente
pt: Troque de forma segura e perfeita

source: TBC Wallet bridges the gap for beginners and experts alike. Its user-friendly design offers easy onboarding for newcomers and advanced tools for DeFi pros, ensuring secure, efficient navigation of the decentralized ecosystem.
ar: محفظة TB تسد الفجوة بين المبتدئين والخبراء. تصميمها سهل الاستخدام يوفّر بداية سلسة للمستخدمين الجدد وأدوات متقدمة لمحترفي DeFi، مما يضمن تنقلًا آمنًا وفعالًا في النظام اللامركزي.
fi: TBC Wallet kaventaa kuilua aloittelijoiden ja asiantuntijoiden välillä. Sen käyttäjäystävällinen muotoilu tarjoaa vaivattoman alun uusille käyttäjille ja edistyneitä työkaluja DeFi-ammattilaisille, varmistaen turvallisen ja tehokkaan navigoinnin hajautetussa ekosysteemissä.
pt: A TBC Wallet faz a ponte entre iniciantes e especialistas. Seu design intuitivo oferece integração fácil para novatos e ferramentas avançadas para profissionais de DeFi, garantindo navegação segura e eficiente no ecossistema descentralizado.

source: TBC Wallet connects you to diverse ecosystems, from Bitcoin and Ethereum to Optimism and Cosmos. Manage portfolios, engage in DeFi, trade NFTs, and link to dApps—all in one secure, self-custody hub.
ar: محفظة TB تربطك بأنظمة بيئية متنوعة، من بيتكوين وإيثيريوم إلى Optimism و Cosmos. أدِر محافظك، وشارك في DeFi، وتداول NFTs، وتواصل مع dApps — كل ذلك من مركز آمن خاضع لسيطرتك.
fi: TBC Wallet yhdistää sinut monipuolisiin ekosysteemeihin, Bitcoinista ja Ethereumista Optimismiin ja Cosmokseen. Hallitse portfoliosi, osallistu DeFiin, käy kauppaa NFT:illä ja linkity dAppseihin — kaikki yhdessä turvallisessa itsehallintakeskuksessa.
pt: A TBC Wallet conecta você a diversos ecossistemas, do Bitcoin e Ethereum ao Optimism e Cosmos. Gerencie portfólios, participe da DeFi, negocie NFTs e conecte-se a dApps — tudo em um hub seguro e de autocustódia.

source: TBC Wallet employs multiple security layers: Encrypted Storage: All private keys are encrypted and stored locally on your device. Multi-Signature Support: Enhanced security for high-value transactions. Biometric Authentication: Fingerprint and face recognition support. Regular Security Updates: Continuous security improvements.
ar: تستخدم محفظة TBC طبقات أمان متعددة: التخزين المشفر: جميع المفاتيح الخاصة مشفرة ومخزنة محليًا على جهازك. دعم التوقيع المتعدد: أمان محسّن للمعاملات عالية القيمة. المصادقة البيومترية: دعم بصمة الإصبع والتعرف على الوجه. تحديثات الأمان المنتظمة: تحسينات أمنية مستمرة.
fi: TBC Wallet käyttää useita turvallisuuskerroksia: Salattu tallennus: Kaikki yksityiset avaimet salataan ja tallennetaan paikallisesti laitteellesi. Moniallekirjoituksen tuki: Parannettu turvallisuus korkean arvon tapahtumille. Biometrinen todennus: Sormenjälki- ja kasvontunnistuksen tuki. Säännölliset turvallisuuspäivitykset: Jatkuvat turvallisuusparannukset.
pt: O TBC Wallet emprega múltiplas camadas de segurança: Armazenamento Criptografado: Todas as chaves privadas são criptografadas e armazenadas localmente no seu dispositivo. Suporte a Assinatura Múltipla: Segurança aprimorada para transações de alto valor. Autenticação Biométrica: Suporte para impressão digital e reconhecimento facial. Atualizações de Segurança Regulares: Melhorias contínuas de segurança.

source: TBC Wallet empowers you to manage diverse assets like Bitcoin, Ethereum, and Solana. Securely dive into DeFi, NFTs, and dApps with full control. Your keys, your future.
ar: محفظة TB تمكّنك من إدارة أصول متنوعة مثل بيتكوين وإيثيريوم وسولانا. انخرط بأمان في DeFi وNFTs وتطبيقات dApps مع تحكّمٍ كامل. مفاتيحك، مستقبلك.

source: TBC Wallet is a leading multi-chain wallet with robust security and an intuitive interface. It simplifies Web3 interactions, from token management to dApp access, while giving you total control over your digital wealth.
ar: محفظة TB هي محفظة متعددة السلاسل رائدة تتميز بأمان قوي وواجهة بديهية. تُبسّط التعاملات مع Web3، من إدارة الرموز إلى الوصول إلى dApps، مع منحك تحكمًا كاملًا بثروتك الرقمية.
fi: TBC Wallet on johtava moniketjuinen lompakko, jolla on vankka turvallisuus ja intuitiivinen käyttöliittymä. Se yksinkertaistaa Web3-vuorovaikutuksia, tokenien hallinnasta dApps-käyttöön, samalla kun se antaa sinulle täyden kontrollin digitaalisesta omaisuudestasi.
pt: A TBC Wallet é uma carteira multi-chain líder com segurança robusta e interface intuitiva. Simplifica as interações Web3, desde a gestão de tokens até o acesso a dApps, garantindo controle total sobre sua riqueza digital.

source: TBC Wallet is a secure, multi-chain cryptocurrency wallet that supports multiple blockchain networks including TBChain, Bitcoin, Ethereum, and Tron. It provides a user-friendly interface for managing digital assets, executing transactions, and accessing DeFi services.
ar: محفظة TBC هي محفظة عملات رقمية آمنة متعددة السلاسل تدعم شبكات بلوك تشين متعددة بما في ذلك TBChain و Bitcoin و Ethereum و Tron. توفر واجهة سهلة الاستخدام لإدارة الأصول الرقمية وتنفيذ المعاملات والوصول إلى خدمات DeFi.

source: TBC Wallet is available on: Mobile: iOS and Android applications, Desktop: Windows and MacOS applications, Browser: Browser extension for Chrome, Firefox, and Edge.
ar: محفظة TBC متاحة على: الهاتف المحمول: تطبيقات iOS و Android، سطح المكتب: تطبيقات Windows و MacOS، المتصفح: امتداد المتصفح لـ Chrome و Firefox و Edge.
fi: TBC Wallet on saatavilla: Mobiili: iOS- ja Android-sovellukset, Työpöytä: Windows- ja MacOS-sovellukset, Selain: Selaimen laajennus Chrome, Firefox ja Edge -selaimille.
pt: O TBC Wallet está disponível em: Mobile: aplicativos iOS e Android, Desktop: aplicativos Windows e MacOS, Navegador: extensão do navegador para Chrome, Firefox e Edge.

source: TBC Wallet supports: TBChain (native network), Bitcoin, Ethereum and EVM-compatible chains, Tron, And more networks continuously being added.
ar: تدعم محفظة TBC: TBChain (الشبكة الأصلية)، Bitcoin، Ethereum والسلاسل المتوافقة مع EVM، Tron، والمزيد من الشبكات التي يتم إضافتها باستمرار.

source: TBChain
ar: سلسلة TB

source: Terms of Service
ar: شروط الخدمة
es: Términos de servicio
fi: Käyttöehdot
fr: Conditions d’utilisation
pt: Termos de serviço

source: The app is not working properly. What can I do?
ar: التطبيق لا يعمل بشكل صحيح. ماذا يمكنني أن أفعل؟
es: La aplicación no funciona correctamente. ¿Qué puedo hacer?
fi: Sovellus ei toimi kunnolla. Mitä voin tehdä?
fr: L'application ne fonctionne pas correctement. Que puis-je faire ?
pt: O aplicativo não está funcionando corretamente. O que posso fazer?

source: The world of Web3 in your pocket
ar: عالم Web3 في جيبك
es: El mundo de Web3 en tu bolsillo
fi: Web3-maailma taskussasi
fr: Le monde du Web3 dans votre poche
pt: O mundo do Web3 no seu bolso

source: To delete a wallet: 1. Go to Settings. 2. Select Wallet Management. 3. Choose the wallet to delete. 4. Confirm deletion (make sure you have your recovery phrase backed up).
ar: لحذف محفظة: 1. انتقل إلى الإعدادات. 2. اختر إدارة المحفظة. 3. اختر المحفظة المراد حذفها. 4. أكد الحذف (تأكد من أن لديك نسخة احتياطية من عبارة الاسترداد).
es: Para eliminar una billetera: 1. Ve a Configuración. 2. Selecciona Gestión de Billetera. 3. Elige la billetera a eliminar. 4. Confirma la eliminación (asegúrate de tener respaldada tu frase de recuperación).
fi: Lompakon poistamiseksi: 1. Siirry Asetuksiin. 2. Valitse Lompakon hallinta. 3. Valitse poistettava lompakko. 4. Vahvista poisto (varmista, että olet varmuuskopioinut palautuslauseesi).
fr: Pour supprimer un portefeuille : 1. Allez dans Paramètres. 2. Sélectionnez Gestion du Portefeuille. 3. Choisissez le portefeuille à supprimer. 4. Confirmez la suppression (assurez-vous d'avoir sauvegardé votre phrase de récupération).
pt: Para excluir uma carteira: 1. Vá para Configurações. 2. Selecione Gerenciamento de Carteira. 3. Escolha a carteira para excluir. 4. Confirme a exclusão (certifique-se de ter feito backup da sua frase de recuperação).

source: Transaction fees are network charges for processing transactions. Fees vary by: Network congestion, Transaction complexity, Priority level selected.
ar: رسوم المعاملات هي رسوم الشبكة لمعالجة المعاملات. تختلف الرسوم حسب: ازدحام الشبكة، تعقيد المعاملة، مستوى الأولوية المحدد.
es: Las tarifas de transacción son cargos de red por procesar transacciones. Las tarifas varían según: Congestión de red, Complejidad de la transacción, Nivel de prioridad seleccionado.
fi: Tapahtumamaksut ovat verkon veloituksia tapahtumien käsittelystä. Maksut vaihtelevat: Verkon ruuhkaisuus, Tapahtuman monimutkaisuus, Valittu prioriteettitaso.
fr: Les frais de transaction sont des frais de réseau pour le traitement des transactions. Les frais varient selon : La congestion du réseau, La complexité de la transaction, Le niveau de priorité sélectionné.
pt: As taxas de transação são cobranças da rede para processar transações. As taxas variam de acordo com: Congestionamento da rede, Complexidade da transação, Nível de prioridade selecionado.

source: Transaction times vary by network: TBChain: Usually completes in seconds. Bitcoin: 10-60 minutes depending on network congestion. Ethereum: 15 seconds to several minutes. Tron: Usually completes in under a minute.
ar: أوقات المعاملات تختلف حسب الشبكة: TBChain: عادةً ما تكتمل في ثوانٍ. Bitcoin: 10-60 دقيقة حسب ازدحام الشبكة. Ethereum: 15 ثانية إلى عدة دقائق. Tron: عادةً ما تكتمل في أقل من دقيقة.

source: Transactions
ar: المعاملات
es: Transacciones
fi: Tapahtumat
pt: Transações

source: Transactions may be pending due to: Network congestion, Low transaction fee, Network maintenance, Insufficient balance.
ar: قد تكون المعاملات معلقة بسبب: ازدحام الشبكة، رسوم معاملة منخفضة، صيانة الشبكة، رصيد غير كافٍ.
es: Las transacciones pueden estar pendientes debido a: Congestión de red, Tarifa de transacción baja, Mantenimiento de red, Saldo insuficiente.
fi: Tapahtumat voivat olla odottamassa seuraavista syistä: Verkon ruuhkaisuus, Matala tapahtumamaksu, Verkon ylläpito, Riittämätön saldo.
fr: Les transactions peuvent être en attente en raison de : Congestion du réseau, Frais de transaction faibles, Maintenance du réseau, Solde insuffisant.
pt: As transações podem estar pendentes devido a: Congestionamento da rede, Taxa de transação baixa, Manutenção da rede, Saldo insuficiente.

source: Tron
ar: ترون

source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها
es: Solución de Problemas
fi: Vianetsintä
fr: Dépannage
pt: Solução de Problemas

source: Try these steps: 1. Update to the latest version. 2. Clear app cache. 3. Restart the application. 4. Reinstall if necessary (make sure you have your recovery phrase).
ar: جرب هذه الخطوات: 1. قم بالتحديث إلى أحدث إصدار. 2. امسح ذاكرة التخزين المؤقت للتطبيق. 3. أعد تشغيل التطبيق. 4. أعد التثبيت إذا لزم الأمر (تأكد من أن لديك عبارة الاسترداد).
es: Prueba estos pasos: 1. Actualiza a la última versión. 2. Limpia la caché de la aplicación. 3. Reinicia la aplicación. 4. Reinstala si es necesario (asegúrate de tener tu frase de recuperación).
fi: Kokeile näitä vaiheita: 1. Päivitä uusimpaan versioon. 2. Tyhjennä sovelluksen välimuisti. 3. Käynnistä sovellus uudelleen. 4. Asenna uudelleen tarvittaessa (varmista, että sinulla on palautuslauseesi).
fr: Essayez ces étapes : 1. Mettez à jour vers la dernière version. 2. Effacez le cache de l'application. 3. Redémarrez l'application. 4. Réinstallez si nécessaire (assurez-vous d'avoir votre phrase de récupération).
pt: Tente estes passos: 1. Atualize para a versão mais recente. 2. Limpe o cache do aplicativo. 3. Reinicie o aplicativo. 4. Reinstale se necessário (certifique-se de ter sua frase de recuperação).

source: Unleash Web3
ar: أطلق العنان للويب 3
es: Libera el Web3
fi: Vapauta Web3
fr: Libérez le Web3
pt: Liberte o Web3

source: Updates are available through: Mobile: App Store or Google Play Store. Desktop: Download from our website. Browser Extension: Update through your browser's extension store.
ar: التحديثات متاحة من خلال: الهاتف المحمول: App Store أو Google Play Store. سطح المكتب: التنزيل من موقعنا الإلكتروني. امتداد المتصفح: التحديث من خلال متجر امتدادات المتصفح.
es: Las actualizaciones están disponibles a través de: Móvil: App Store o Google Play Store. Escritorio: Descarga desde nuestro sitio web. Extensión del Navegador: Actualiza a través de la tienda de extensiones de tu navegador.
fi: Päivitykset ovat saatavilla: Mobiili: App Store tai Google Play Store. Työpöytä: Lataa verkkosivuiltamme. Selaimen laajennus: Päivitä selaimen laajennuskaupasta.
fr: Les mises à jour sont disponibles via : Mobile : App Store ou Google Play Store. Bureau : Téléchargez depuis notre site web. Extension de Navigateur : Mettez à jour via le magasin d'extensions de votre navigateur.
pt: As atualizações estão disponíveis através de: Mobile: App Store ou Google Play Store. Desktop: Baixe do nosso site. Extensão do Navegador: Atualize através da loja de extensões do seu navegador.

source: USDT fee
ar: رسوم USDT
es: Tarifa USDT
fi: USDT-maksu
fr: Frais USDT
pt: Taxa USDT

source: USDT Fee
ar: رسوم USDT
es: Tarifa en USDT
fi: USDT-maksu
fr: Frais en USDT
pt: Taxa em USDT

source: Visit our website for detailed documentation. Check our blog for updates and tutorials. Join our community on Telegram and Discord. Follow us on social media for the latest news.
ar: قم بزيارة موقعنا الإلكتروني للحصول على وثائق مفصلة. تحقق من مدونتنا للحصول على التحديثات والدروس التعليمية. انضم إلى مجتمعنا على Telegram و Discord. تابعنا على وسائل التواصل الاجتماعي للحصول على آخر الأخبار.
es: Visita nuestro sitio web para documentación detallada. Consulta nuestro blog para actualizaciones y tutoriales. Únete a nuestra comunidad en Telegram y Discord. Síguenos en redes sociales para las últimas noticias.
fi: Vieraile verkkosivuiltamme saadaksesi yksityiskohtaista dokumentaatiota. Tarkista blogimme päivityksiä ja opetusohjelmia varten. Liity yhteisöömme Telegramissa ja Discordissa. Seuraa meitä sosiaalisessa mediassa saadaksesi uusimmat uutiset.
fr: Visitez notre site web pour une documentation détaillée. Consultez notre blog pour les mises à jour et tutoriels. Rejoignez notre communauté sur Telegram et Discord. Suivez-nous sur les réseaux sociaux pour les dernières nouvelles.
pt: Visite nosso site para documentação detalhada. Confira nosso blog para atualizações e tutoriais. Junte-se à nossa comunidade no Telegram e Discord. Siga-nos nas redes sociais para as últimas notícias.

source: Wallet
ar: المحفظة
es: Billetera
fi: Lompakko
fr: Portefeuille
pt: Carteira

source: We’re launching soon!
ar: سننطلق قريبًا!
es: ¡Lanzaremos pronto!
fi: Julkaisemme pian!
fr: Nous lançons bientôt !
pt: Lançaremos em breve!

source: What are transaction fees?
ar: ما هي رسوم المعاملات؟
es: ¿Qué son las tarifas de transacción?
fi: Mitä ovat tapahtumamaksut?
fr: Quels sont les frais de transaction ?
pt: O que são taxas de transação?

source: What are your support hours?
ar: ما هي ساعات الدعم لديكم؟
es: ¿Cuáles son sus horarios de soporte?
fi: Mitkä ovat tukesi aukioloajat?
fr: Quels sont vos horaires de support ?
pt: Quais são os horários de suporte?

source: What blockchain networks are supported?
ar: ما هي شبكات البلوك تشين المدعومة؟
es: ¿Qué redes blockchain están soportadas?
fi: Mitkä lohkoketjeverkot ovat tuettuja?
fr: Quels réseaux blockchain sont pris en charge ?
pt: Quais redes blockchain são suportadas?

source: What information should I provide when contacting support?
ar: ما هي المعلومات التي يجب أن أقدمها عند الاتصال بالدعم؟
es: ¿Qué información debo proporcionar al contactar al soporte?
fi: Mitä tietoja minun pitäisi antaa ottaessani yhteyttä tukeen?
fr: Quelles informations dois-je fournir lors du contact avec le support ?
pt: Quais informações devo fornecer ao entrar em contato com o suporte?

source: What is Multi-Signature?
ar: ما هي التوقيع المتعدد؟
es: ¿Qué es la Firma Múltiple?
fi: Mikä on moniallekirjoitus?
fr: Qu'est-ce que la Signature Multiple ?
pt: O que é Assinatura Múltipla?

source: What is TBC Wallet?
ar: ما هي محفظة TBC؟
fi: Mikä on TBC Wallet?
pt: O que é o TBC Wallet?

source: What should I do if I lose my device?
ar: ماذا يجب أن أفعل إذا فقدت جهازي؟
es: ¿Qué debo hacer si pierdo mi dispositivo?
fi: Mitä minun pitäisi tehdä, jos kadotan laitteeni?
fr: Que dois-je faire si je perds mon appareil ?
pt: O que devo fazer se perder meu dispositivo?

source: What you need to know to use our services
ar: ما تحتاج معرفته لاستخدام خدماتنا
es: Lo que necesitas saber para usar nuestros servicios
fi: Mitä sinun tarvitsee tietää palveluidemme käyttämiseksi
fr: Ce que vous devez savoir pour utiliser nos services
pt: O que você precisa saber para usar nossos serviços

source: When contacting support, please provide: Your wallet version, Device and operating system, Description of the issue, Screenshots if applicable, Transaction hash if related to a transaction.
ar: عند الاتصال بالدعم، يرجى تقديم: إصدار محفظتك، الجهاز ونظام التشغيل، وصف المشكلة، لقطات الشاشة إن أمكن، hash المعاملة إذا كانت متعلقة بمعاملة.
es: Al contactar al soporte, por favor proporciona: Tu versión de billetera, Dispositivo y sistema operativo, Descripción del problema, Capturas de pantalla si aplica, Hash de transacción si está relacionado con una transacción.
fi: Ottaessasi yhteyttä tukeen, anna: Lompakkosi versio, Laitteesi ja käyttöjärjestelmä, Ongelman kuvaus, Kuvakaappaukset tarvittaessa, Tapahtuman hash, jos liittyy tapahtumaan.
fr: Lors du contact avec le support, veuillez fournir : Votre version de portefeuille, Appareil et système d'exploitation, Description du problème, Captures d'écran si applicable, Hash de transaction si lié à une transaction.
pt: Ao entrar em contato com o suporte, forneça: Sua versão da carteira, Dispositivo e sistema operacional, Descrição do problema, Capturas de tela se aplicável, Hash da transação se relacionado a uma transação.

source: Where can I learn more about TBC Wallet?
ar: أين يمكنني معرفة المزيد عن محفظة TBC؟
fi: Mistä voin oppia lisää TBC Walletista?
pt: Onde posso saber mais sobre o TBC Wallet?

source: Which platforms does TBC Wallet support?
ar: ما هي المنصات التي تدعمها محفظة TBC؟
fi: Mitkä alustat TBC Wallet tukee?
pt: Quais plataformas o TBC Wallet suporta?
